#### Terraform Format and Style `success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform
module.apis.google_project_service.enable_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/artifactregistry.googleapis.com]
module.apis.google_project_service.enable_apis["secretmanager.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/secretmanager.googleapis.com]
module.apis.google_project_service.enable_apis["serviceusage.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/serviceusage.googleapis.com]
module.apis.google_project_service.enable_apis["vpcaccess.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/vpcaccess.googleapis.com]
module.apis.google_project_service.enable_apis["compute.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/compute.googleapis.com]
module.apis.google_project_service.enable_apis["containerscanning.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/containerscanning.googleapis.com]
module.apis.google_project_service.enable_apis["servicenetworking.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/servicenetworking.googleapis.com]
module.apis.google_project_service.enable_apis["run.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/run.googleapis.com]
module.apis.google_project_service.enable_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=warehouse-dev-363006/cloudresourcemanager.googleapis.com]
module.test_service_account.google_service_account.service-account["compute-instance-sa"]: Refreshing state... [id=projects/warehouse-dev-363006/serviceAccounts/test-compute-instance-sa-dev@warehouse-dev-363006.iam.gserviceaccount.com]
google_project_iam_binding.compute-stop: Refreshing state... [id=warehouse-dev-363006/roles/compute.instanceAdmin]
module.vpc.google_compute_network.vpc_network: Refreshing state... [id=projects/warehouse-dev-363006/global/networks/test-vpc-dev]
module.test_service_account.google_service_account.service-account["cloud-run-deployment"]: Refreshing state... [id=projects/warehouse-dev-363006/serviceAccounts/test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
google_service_account_iam_member.github_repo_binding["cloud-run-deployment-saurabhMendhe/selling-service"]: Refreshing state... [id=projects/warehouse-dev-363006/serviceAccounts/test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/332496079606/locations/global/workloadIdentityPools/test-workload-identity-pool-dev/attribute.repository/saurabhMendhe/selling-service]
module.test_artifact_registory_repositories.google_artifact_registry_repository.artifact_repos["product-service"]: Refreshing state... [id=projects/warehouse-dev-363006/locations/europe-west4/repositories/test-product-service-eu-dev]
module.test_artifact_registory_repositories.google_artifact_registry_repository.artifact_repos["selling-service"]: Refreshing state... [id=projects/warehouse-dev-363006/locations/europe-west4/repositories/test-selling-service-eu-dev]
google_service_account_iam_member.github_repo_binding["cloud-run-deployment-saurabhMendhe/inventory-service"]: Refreshing state... [id=projects/warehouse-dev-363006/serviceAccounts/test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/332496079606/locations/global/workloadIdentityPools/test-workload-identity-pool-dev/attribute.repository/saurabhMendhe/inventory-service]
google_service_account_iam_member.github_repo_binding["cloud-run-deployment-saurabhMendhe/product-service"]: Refreshing state... [id=projects/warehouse-dev-363006/serviceAccounts/test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/332496079606/locations/global/workloadIdentityPools/test-workload-identity-pool-dev/attribute.repository/saurabhMendhe/product-service]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[4]: Refreshing state... [id=warehouse-dev-363006/roles/storage.admin/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_artifact_registory_repositories.google_artifact_registry_repository.artifact_repos["inventory-service"]: Refreshing state... [id=projects/warehouse-dev-363006/locations/europe-west4/repositories/test-inventory-service-eu-dev]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/warehouse-dev-363006/locations/global/workloadIdentityPools/test-workload-identity-pool-dev]
module.test_iam_member["compute-instance-sa"].google_project_iam_member.iam-member[0]: Refreshing state... [id=warehouse-dev-363006/roles/cloudsql.viewer/serviceAccount:test-compute-instance-sa-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[5]: Refreshing state... [id=warehouse-dev-363006/roles/artifactregistry.writer/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[6]: Refreshing state... [id=warehouse-dev-363006/roles/artifactregistry.reader/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[0]: Refreshing state... [id=warehouse-dev-363006/roles/storage.objectAdmin/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[1]: Refreshing state... [id=warehouse-dev-363006/roles/iam.serviceAccountUser/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[2]: Refreshing state... [id=warehouse-dev-363006/roles/run.admin/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[3]: Refreshing state... [id=warehouse-dev-363006/roles/secretmanager.secretAccessor/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com]
google_compute_resource_policy.vm-start-stop: Refreshing state... [id=projects/warehouse-dev-363006/regions/europe-west4/resourcePolicies/test-vm-start-stop-every-day-dev]
google_compute_firewall.rules-ssh: Refreshing state... [id=projects/warehouse-dev-363006/global/firewalls/allow-ssh]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/warehouse-dev-363006/locations/global/workloadIdentityPools/test-workload-identity-pool-dev/providers/github]
module.subnet.google_compute_subnetwork.subnetwork["sub_net_1"]: Refreshing state... [id=projects/warehouse-dev-363006/regions/europe-west4/subnetworks/test-subnet-01-dev]
module.compute-instances.google_compute_instance.compute-instance["compute-instance"]: Refreshing state... [id=projects/warehouse-dev-363006/zones/europe-west4-a/instances/test-compute-instance-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_project_iam_binding.compute-stop has changed
  ~ resource "google_project_iam_binding" "compute-stop" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/compute.instanceAdmin"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[0] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/storage.objectAdmin/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[1] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/iam.serviceAccountUser/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[2] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/run.admin/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[3] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/secretmanager.secretAccessor/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[4] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/storage.admin/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[5] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/artifactregistry.writer/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["cloud-run-deployment"].google_project_iam_member.iam-member[6] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/artifactregistry.reader/serviceAccount:test-cloud-run-deployment-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.test_iam_member["compute-instance-sa"].google_project_iam_member.iam-member[0] has changed
  ~ resource "google_project_iam_member" "iam-member" {
      ~ etag    = "BwXpByIG214=" -> "BwXpDSYKzn0="
        id      = "warehouse-dev-363006/roles/cloudsql.viewer/serviceAccount:test-compute-instance-sa-dev@warehouse-dev-363006.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test_iam_member["inventory-svc"].google_project_iam_member.iam-member[0] will be created
  + resource "google_project_iam_member" "iam-member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:test-inventory-svc-dev@warehouse-dev-363006.iam.gserviceaccount.com"
      + project = "warehouse-dev-363006"
      + role    = "roles/pubsub.subscriber"
    }

  # module.test_iam_member["product-svc"].google_project_iam_member.iam-member[0] will be created
  + resource "google_project_iam_member" "iam-member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:test-product-svc-dev@warehouse-dev-363006.iam.gserviceaccount.com"
      + project = "warehouse-dev-363006"
      + role    = "roles/pubsub.subscriber"
    }

  # module.test_iam_member["selling-svc"].google_project_iam_member.iam-member[0] will be created
  + resource "google_project_iam_member" "iam-member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:test-selling-svc-dev@warehouse-dev-363006.iam.gserviceaccount.com"
      + project = "warehouse-dev-363006"
      + role    = "roles/run.invoker"
    }

  # module.test_service_account.google_service_account.service-account["inventory-svc"] will be created
  + resource "google_service_account" "service-account" {
      + account_id   = "test-inventory-svc-dev"
      + description  = "This SA will be used by Cloud run Inventory Service"
      + disabled     = false
      + display_name = "inventory-svc SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.test_service_account.google_service_account.service-account["product-svc"] will be created
  + resource "google_service_account" "service-account" {
      + account_id   = "test-product-svc-dev"
      + description  = "This SA will be used by Cloud run product Service"
      + disabled     = false
      + display_name = "product-svc SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.test_service_account.google_service_account.service-account["selling-svc"] will be created
  + resource "google_service_account" "service-account" {
      + account_id   = "test-selling-svc-dev"
      + description  = "This SA will be used by Cloud run Selling Service"
      + disabled     = false
      + display_name = "selling-svc SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: dev-planfile.out

To perform exactly these actions, run the following command to apply:
    terraform apply "dev-planfile.out"

```

</details>

*Pusher: @saurabhMendhe, Action: `pull_request`*